#Дано целое положительное число. Вывести символы, изображающие цифры этого
#числа (в порядке слева направо).
num = input("Введите число: ")
print(type(num))
result = num.split()
print(result)

